{"kind":"youtube#playlistItem","etag":"RjGgMyDfmnbJqblk9KleoYsB49Y","id":"VVUzdzE5M001dFlQSnFGMEhpLTdVLTJnLkZLcDBjNDREeVVV","snippet":{"publishedAt":"2021-12-24T17:46:31Z","channelId":"UC3w193M5tYPJqF0Hi-7U-2g","title":"The Dr. Berg Show LIVE","description":"Talk to Dr. Berg LIVE ➜ ➜ https://forms.gle/3a3n9arSxwDtqboa7\n\nGo Here: YouTube ➜ ➜https://youtu.be/mkVwcZKWzyc\nFacebook ➜ ➜https://www.facebook.com/events/1114390705638859/\n\nGet your keto and intermittent fasting questions answered in a LIVE one-on-one with Dr. Berg!\nTo be considered, click on the link below to fill out the application! If you’d like to join next week’s show, make sure you fill out the application by Tuesday night the week of the live show. \n\nFill this out to be a part of the LIVE show! — https://drberg.com/live\n\nParticipants will be selected on Wednesdays, and an invitation with the unique link to join the show will be sent out on the Thursday afternoon before the Friday Live Show. I hope to talk with you soon!\n\nTalk to a Dr. Berg Keto Consultant today and get the help you need on your journey. Call 1-540-299-1556 with your questions about Keto, Intermittent Fasting or the use of Dr. Berg products. Consultants are available Monday through Friday from 8 am to 10 pm ET. Saturday & Sunday from 9 am to 6 pm ET. USA Only.\n\nTAKE MY COURSE AT ZERO COST: \nHow to Bulletproof your Immune System – Courses by Dr.Berg\nhttps://courses.drberg.com/product/how-to-bulletproof-your-immune-system/\n\n1:52 I can fall asleep, but I wake up in the middle of the night. What can I do? \n11:20 Quiz question: T/F: Cooking significantly eliminates oxalates in foods\n11:55 How can I determine how many calories I need? \n13:00 Vitamin D toxicity \n14:15 A success story \n14:42 Hello to our viewers around the world \n15:30 If we eat fewer calories, do daily required nutrition values change? \n16:35 I don’t want to miss out on certain foods—what can I do? \n20:22 How can I get back on Keto easily after taking a break from it? \n23:10 Quiz answer: T/F: Cooking significantly eliminates oxalates in foods\n24:08 Quiz question: T/F: Cellulite is caused by a loss of collagen under the skin \n24:30 I have issues digesting nutritional yeast. What can I do?\n25:00 What can I do for seborrheic dermatitis? \n26:10 What are your thoughts on olive oil from Morocco? \n26:38 Is it normal for me to lose a lot of weight really fast? \n28:35 My mind is busy, and I can’t sleep—what can I do?\n31:20 Quiz answer: T/F: Cellulite is caused by a loss of collagen under the skin \n32:48 Quiz question: What is the primary cause of dark circles under the eyes? \n33:18 I have chronic gastritis and gallstones. What can I do? \n36:50 How can I maximize muscle growth on Keto and IF\n38:09 Quiz answer: What is the primary cause of dark circles under the eyes? \n40:22 I wake up feeling shaky, and I can’t fast long. What am I missing? \n41:00 Quiz question: What is the acceptable amount of red wine you can consume after dinner? \n41:17 Is sea kelp good for liver or kidney cysts? \n42:25 I can’t sleep through the night.\n44:40 What do you think about melatonin supplements? \n45:55 I struggle with fasting and can’t take MCT oil. What can I do? \n49:35 Quiz answer: What is the acceptable amount of red wine you can consume after dinner? \n52:50 My wife just had a baby and is not producing milk. What can she do? \n55:40 Quiz question: T/F: You never want to cook with olive oil \n56:10 Am I taking the right supplements? \n1:02:06 Quiz answer: T/F: You never want to cook with olive oil \n1:02:49 Upcoming videos\n1:03:28 Happy New Year! \n\nDr. Eric Berg DC Bio: \nDr. Berg, age 55, is a chiropractor who specializes in Healthy Ketosis & Intermittent Fasting. He is the author of the best-selling book The Healthy Keto Plan, and is the Director of Dr. Berg Nutritionals. He no longer practices, but focuses on health education through social media.\n\nFollow us on FACEBOOK: fb.me/DrEricBerg \n\nSend a Message to his team: m.me/DrEricBerg\n\nABOUT DR. BERG: https://bit.ly/39LCWg8\n\nDisclaimer: Dr. Eric Berg received his Doctor of Chiropractic degree from Palmer College of Chiropractic in 1988. His use of “doctor” or “Dr.” in relation to himself solely refers to that degree. Dr. Berg is a licensed chiropractor in Virginia, California, and Louisiana, but he no longer practices chiropractic in any state and does not see patients so he can focus on educating people as a full-time activity, yet he maintains an active license. This video is for general informational purposes only. It should not be used to self-diagnose and it is not a substitute for a medical exam, cure, treatment, diagnosis, and prescription or recommendation. It does not create a doctor-patient relationship between Dr. Berg and you. You should not make any change in your health regimen or diet before first consulting a physician and obtaining a medical exam, diagnosis, and recommendation. Always seek the advice of a physician or other qualified health provider with any questions you may have regarding a medical condition. The Health & Wellness, Dr. Berg Nutritionals and Dr. Eric Berg, D.C. are not liable or responsible for any advice, course of treatment, diagnosis or any other information, services or product you obtain through this video or site.","thumbnails":{"default":{"url":"https://i.ytimg.com/vi/FKp0c44DyUU/default.jpg","width":120,"height":90},"medium":{"url":"https://i.ytimg.com/vi/FKp0c44DyUU/mqdefault.jpg","width":320,"height":180},"high":{"url":"https://i.ytimg.com/vi/FKp0c44DyUU/hqdefault.jpg","width":480,"height":360},"standard":{"url":"https://i.ytimg.com/vi/FKp0c44DyUU/sddefault.jpg","width":640,"height":480},"maxres":{"url":"https://i.ytimg.com/vi/FKp0c44DyUU/maxresdefault.jpg","width":1280,"height":720}},"channelTitle":"Dr. Eric Berg DC","playlistId":"UU3w193M5tYPJqF0Hi-7U-2g","position":13,"resourceId":{"kind":"youtube#video","videoId":"FKp0c44DyUU"},"videoOwnerChannelTitle":"Dr. Eric Berg DC","videoOwnerChannelId":"UC3w193M5tYPJqF0Hi-7U-2g"},"contentDetails":{"videoId":"FKp0c44DyUU","videoPublishedAt":"2021-12-30T17:08:40Z"}}